Revit 2027 API
CitySet.Insert Method
Insert the specified city into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	City item
)
Public Overridable Function Insert (
	item As City
) As Boolean
public:
virtual bool Insert(
	City^ item
)
abstract Insert :
        item : City -> bool
override Insert :
        item : City -> bool
Parameters
item City
The city to be inserted into the set.
Return Value
Boolean
Returns whether the city was inserted into the set.
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace